results/raw/proxysql_ffto_extended_tlsFalse_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 131459
number of failed transactions: 0 (0.000%)
latency average = 1.369 ms
latency stddev = 0.244 ms
initial connection time = 11.621 ms
tps = 730.373877 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 672.0 tps, lat 1.486 ms stddev 0.315, 0 failed
progress: 20.0 s, 785.1 tps, lat 1.274 ms stddev 0.145, 0 failed
progress: 30.0 s, 763.9 tps, lat 1.309 ms stddev 0.134, 0 failed
progress: 40.0 s, 861.2 tps, lat 1.161 ms stddev 0.068, 0 failed
progress: 50.0 s, 877.8 tps, lat 1.139 ms stddev 0.054, 0 failed
progress: 60.0 s, 830.8 tps, lat 1.203 ms stddev 0.177, 0 failed
progress: 70.0 s, 815.4 tps, lat 1.226 ms stddev 0.152, 0 failed
progress: 80.0 s, 684.4 tps, lat 1.461 ms stddev 0.076, 0 failed
progress: 90.0 s, 694.2 tps, lat 1.440 ms stddev 0.068, 0 failed
progress: 100.0 s, 690.3 tps, lat 1.448 ms stddev 0.071, 0 failed
progress: 110.0 s, 611.1 tps, lat 1.636 ms stddev 0.133, 0 failed
progress: 120.0 s, 595.0 tps, lat 1.680 ms stddev 0.101, 0 failed
progress: 130.0 s, 836.7 tps, lat 1.195 ms stddev 0.121, 0 failed
progress: 140.0 s, 854.5 tps, lat 1.170 ms stddev 0.084, 0 failed
progress: 150.0 s, 827.1 tps, lat 1.209 ms stddev 0.097, 0 failed
progress: 160.0 s, 596.1 tps, lat 1.677 ms stddev 0.174, 0 failed
progress: 170.0 s, 572.1 tps, lat 1.748 ms stddev 0.115, 0 failed
progress: 180.0 s, 578.1 tps, lat 1.729 ms stddev 0.105, 0 failed