results/raw/proxysql_ffto_prepared_tlsTrue_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 136135
number of failed transactions: 0 (0.000%)
latency average = 1.322 ms
latency stddev = 0.318 ms
initial connection time = 15.655 ms
tps = 756.365720 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 742.5 tps, lat 1.344 ms stddev 0.430, 0 failed
progress: 20.0 s, 835.0 tps, lat 1.197 ms stddev 0.074, 0 failed
progress: 30.0 s, 762.3 tps, lat 1.311 ms stddev 0.129, 0 failed
progress: 40.0 s, 817.1 tps, lat 1.223 ms stddev 0.070, 0 failed
progress: 50.0 s, 835.0 tps, lat 1.197 ms stddev 0.067, 0 failed
progress: 60.0 s, 502.5 tps, lat 1.990 ms stddev 0.639, 0 failed
progress: 70.0 s, 466.6 tps, lat 2.143 ms stddev 0.599, 0 failed
progress: 80.0 s, 830.9 tps, lat 1.203 ms stddev 0.077, 0 failed
progress: 90.0 s, 834.7 tps, lat 1.198 ms stddev 0.103, 0 failed
progress: 100.0 s, 615.0 tps, lat 1.626 ms stddev 0.272, 0 failed
progress: 110.0 s, 742.8 tps, lat 1.346 ms stddev 0.087, 0 failed
progress: 120.0 s, 762.3 tps, lat 1.312 ms stddev 0.128, 0 failed
progress: 130.0 s, 824.8 tps, lat 1.212 ms stddev 0.067, 0 failed
progress: 140.0 s, 829.2 tps, lat 1.206 ms stddev 0.080, 0 failed
progress: 150.0 s, 856.6 tps, lat 1.167 ms stddev 0.054, 0 failed
progress: 160.0 s, 856.1 tps, lat 1.168 ms stddev 0.047, 0 failed
progress: 170.0 s, 787.7 tps, lat 1.269 ms stddev 0.146, 0 failed
progress: 180.0 s, 712.3 tps, lat 1.404 ms stddev 0.103, 0 failed