results/raw/proxysql_ffto_simple_tlsFalse_c16.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 16
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1211031
number of failed transactions: 0 (0.000%)
latency average = 2.376 ms
latency stddev = 1.046 ms
initial connection time = 105.328 ms
tps = 6731.547938 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 6600.6 tps, lat 2.398 ms stddev 1.039, 0 failed
progress: 20.0 s, 6767.2 tps, lat 2.364 ms stddev 1.001, 0 failed
progress: 30.0 s, 6768.2 tps, lat 2.364 ms stddev 0.991, 0 failed
progress: 40.0 s, 6696.8 tps, lat 2.389 ms stddev 1.208, 0 failed
progress: 50.0 s, 6695.4 tps, lat 2.389 ms stddev 1.120, 0 failed
progress: 60.0 s, 6661.0 tps, lat 2.402 ms stddev 1.225, 0 failed
progress: 70.0 s, 6713.2 tps, lat 2.383 ms stddev 1.140, 0 failed
progress: 80.0 s, 6718.1 tps, lat 2.381 ms stddev 1.009, 0 failed
progress: 90.0 s, 6584.8 tps, lat 2.430 ms stddev 1.041, 0 failed
progress: 100.0 s, 6680.3 tps, lat 2.395 ms stddev 1.016, 0 failed
progress: 110.0 s, 6720.0 tps, lat 2.381 ms stddev 1.000, 0 failed
progress: 120.0 s, 6836.8 tps, lat 2.340 ms stddev 0.990, 0 failed
progress: 130.0 s, 6824.5 tps, lat 2.344 ms stddev 1.004, 0 failed
progress: 140.0 s, 6767.4 tps, lat 2.364 ms stddev 1.010, 0 failed
progress: 150.0 s, 6773.8 tps, lat 2.362 ms stddev 0.999, 0 failed
progress: 160.0 s, 6771.3 tps, lat 2.362 ms stddev 0.998, 0 failed
progress: 170.0 s, 6716.0 tps, lat 2.382 ms stddev 0.982, 0 failed