results/raw/proxysql_ffto_simple_tlsTrue_c64.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 64
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1236496
number of failed transactions: 0 (0.000%)
latency average = 9.301 ms
latency stddev = 9.519 ms
initial connection time = 280.107 ms
tps = 6878.660684 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 6601.5 tps, lat 9.413 ms stddev 9.501, 0 failed
progress: 20.0 s, 6901.4 tps, lat 9.268 ms stddev 9.606, 0 failed
progress: 30.0 s, 6686.1 tps, lat 9.573 ms stddev 9.703, 0 failed
progress: 40.0 s, 6911.2 tps, lat 9.254 ms stddev 9.623, 0 failed
progress: 50.0 s, 6884.9 tps, lat 9.298 ms stddev 9.556, 0 failed
progress: 60.0 s, 6943.5 tps, lat 9.215 ms stddev 9.349, 0 failed
progress: 70.0 s, 6992.0 tps, lat 9.150 ms stddev 9.269, 0 failed
progress: 80.0 s, 6966.3 tps, lat 9.186 ms stddev 9.387, 0 failed
progress: 90.0 s, 6985.2 tps, lat 9.160 ms stddev 9.316, 0 failed
progress: 100.0 s, 6888.8 tps, lat 9.282 ms stddev 9.528, 0 failed
progress: 110.0 s, 6944.2 tps, lat 9.220 ms stddev 9.376, 0 failed
progress: 120.0 s, 6926.6 tps, lat 9.230 ms stddev 9.420, 0 failed
progress: 130.0 s, 6926.9 tps, lat 9.241 ms stddev 9.333, 0 failed
progress: 140.0 s, 6877.7 tps, lat 9.302 ms stddev 9.656, 0 failed
progress: 150.0 s, 6740.9 tps, lat 9.494 ms stddev 9.691, 0 failed
progress: 160.0 s, 6774.1 tps, lat 9.444 ms stddev 9.437, 0 failed
progress: 170.0 s, 6843.8 tps, lat 9.351 ms stddev 9.677, 0 failed
progress: 180.0 s, 6848.8 tps, lat 9.340 ms stddev 9.874, 0 failed